---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FieldValues Constructor
FieldValues Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | FieldValues(FieldValues) | Creates a copy of the given FieldValues instance. |
|  | FieldValues(IList<(Of <<'(ValueAtPoint>)>>)) | Creates object from an array of domain point values |
|  | FieldValues(IList<(Of <<'(VectorAtPoint>)>>)) | Creates object from an array of domain point vectors |
|  | FieldValues(IList<(Of <<'(ValueAtPoint>)>>), XYZ) | Creates object from an array of domain point values |

# See Also

FieldValues Class

FieldValues Members

Autodesk.Revit.DB.Analysis Namespace